[
    {
      "id": "6357d320755f4030c95a05fd",
      "picture": "https://static.thenounproject.com/png/4647446-200.png",
      "title": "Software Engineering Fundamentals",
      "lectures": 48,
      "rating": 5,
      "description": "Software engineering is a discipline that allows us to apply engineering and computer science concepts in the development and maintenance of reliable, usable, and dependable software. The concept of software engineering was first discussed at the 1968 NATO Science Committee in Germany. There are several areas to focus on within software engineering, such as design, development, testing, maintenance, and management.",
      "price": 120
    },
    {
      "id": "6357d3203e40374fbe966f78",
      "picture": "https://cdn-images-1.medium.com/max/800/1*35nsqVrMg1EdAG_EdZt7jQ.png",
      "title": "Introduction to Java as a Second Language",
      "lectures": 38,
      "rating": 5,
      "description": "Java is among the most popular programming languages out there, mainly because of how versatile and compatible it is. Java can be used for a large number of things, including software development, mobile applications, and large systems development. Knowing Java opens a great deal of doors for you as a developer.Using java programming language we can create distributed applications. ",
      "price":130
    },
    {
      "id": "6357d3202461709c45b03100",
      "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR8gjWRgjwnh76gKY6dstTJ4D28Rzs2CqkdGw&usqp=CAU",
      "title": "Object Oriented Programming in Java. First step",
      "lectures": 45,
      "rating": 5,
      "description": "As the name suggests, Object-Oriented Programming or OOPs refers to languages that use objects in programming, they use objects as a primary source to implement what is to happen in the code. Objects are seen by the viewer or user, performing tasks assigned by you. Object-oriented programming aims to implement real-world entities like inheritance, hiding, polymorphism etc. in programming. ",
      "price": 110
    },
    {
      "id": "6357d3206df6309420650d2a",
      "picture": "http://p92.com/binaries/content/gallery/p92website/technologies/htmlcssjs-overview.png",
      "title": "HTML, CSS, and Javascript for Web Developers",
      "lectures": 35,
      "rating": 5,
      "description": "As a web developer, the three main languages we use to build websites are HTML, CSS, and JavaScript. JavaScript is the programming language, we use HTML to structure the site, and we use CSS to design and layout the web page. These days, CSS has become more than just a design language, though.If you are learning web development, you will come across terms like HTML, CSS, and JavaScript. ",
      "price": 115
    },
    {
      "id": "6357d320acb7042533d840bb",
      "picture": "https://miro.medium.com/max/1400/1*DeI5w0VNfX-FM9CS3JXZnQ.png",
      "title": "Introduction to Programming with Python",
      "lectures": 55,
      "rating": 5,
      "description": "In this course, you'll learn the fundamentals of the Python programming language, along with programming best practices. You’ll learn to represent and store data using Python data types and variables, and use conditionals and loops to control the flow of your programs. You’ll harness the power of complex data structures like lists, sets, dictionaries, and tuples to store collections of related data.",
      "price": 100
    },
    {
      "id": "6357d3209a5ddae79931ed4c",
      "picture": "https://www.isaca.org/-/media/images/isacadp/project/isaca/certs/cet/cet_badge-blockchain.ash",
      "title": "Fundamental blockchain technology",
      "lectures": 58,
      "rating": 5,
      "description": "The growing popularity of cryptocurrencies has aroused mainstream interest in blockchain technologies and their possibilities. Increasingly, blockchain is used as a generic term that most people associate with Bitcoin, the cryptocurrency created using the technology. The potential and scope of the application of decentralized protocols have already become so much broader.",
      "price": 150
    }
  ]